{"podcast_details": {"podcast_title": "This Day in Metal", "episode_title": "This Day in Metal with Kurdt Vanderhoof", "episode_image": "https://media.rss.com/thisdayinmetal/20211125_011117_182dbbababb62473590390b6fe20414c.jpg", "episode_link": "https://rss.com/podcasts/thisdayinmetal/997879", "episode_transcript": " Well, hello, Kurt. Thanks for coming on the This Day in Metal podcast today. How are you doing? Doing awesome. How are you? Pretty good. First off, I want to say I'm a huge fan of the band. I've been following you guys and listening forever. Like, what's it been now? 40, 40 years now? Yeah. We'll be quiet about that. But, Dan, that's been a lot of great music you put out. Thank you. I really enjoyed the... You have a new singer, Mark Lopez. How'd you go about hooking up with him? It's Mark Lopes, actually. Yeah, he gets called Lopez a lot. He was a friend of Stett and Steeves. And we had crossed paths in doing European festivals and stuff like that. So he was kind of already in our orbit, is what I've been saying. Because we didn't want to do... And I didn't really want to do this massive international campaign and make a big production of it. Because at the time, I wasn't sure if we were going to continue. So it was just more of, well, let's see if we can have something that feels right, take it one step at a time. And we're still kind of in that process. But now we've moved on to trying things and doing the live thing now. So yeah, so that was how he came into the picture. Nice. So do you have any unreleased songs with Mike Howe? He was an amazing singer and I would love to hear more songs from him. At this point, no, not really. There might be some in the old, old, old archives from all the old analog tapes and stuff, which I still have, fortunately. But yeah, not that I'm really confident about or anything that would be even listenable at all. That he's had that there's nothing that I know of that he would approve of being released. So let's put it that way. So you have this new album coming out that just came out on May 26th, I believe, Congregation of Annihilation. Could you tell me about the about the album and how it came about? Well, right before Mike passed, I had been in contact with him and we started the process and I had written a new album and I gave it to deliver it to him. And we had just started the collaboration process. And then within weeks or I can't remember exactly the timeline, then I got the call that he had passed. And so that's when I kind of so there was a new album sitting there. And so that was kind of why, again, for a couple of months, I didn't know if I was going to if I was going to keep going. It's kind of like having two singers lose. I'm kind of going, am I missing the message here or something? So I was basically looked at it like, well, after a couple of months, I was like, you know, maybe if nothing else, maybe we can do this as a tribute to Mike, because there's a whole album sitting there. You know, and again, did not want to do a massive campaign for a singer because it might not work. We might just go, hey, now we're done. It's time to put it to bed. But you know, so when we found Mark and things kept working and working, and we also I also realized that with his voice and the way he his delivery, it was a much more aggressive back to our thrashy kind of roots, more aggressive type of thing. And so that even though I had this whole album sitting there, half of it was more along the lines of the Mike Howell stuff, which was, for the most part, you know, by today's standards, melodic hard rock, you know, and this was definitely something new, which was great, because that kind of made me feel a little more right in as much as having this if we are going to continue, let's turn a page, let's have it be something different. Let's not have it be, you know, just let's not find a Mike clone. Let's not just try to keep going with what we're doing. Let's do something different. Let's have it be a page, turn a page on it. And so I ended up when we decided that, okay, we're going to continue moving forward with Mark. So I wrote another batch of songs. So half of it is old songs, half of it is new songs, because we had kind of we realized that we kind of had a new direction. So that's how it came about. Nice. The songs are amazing. Do you have any plan of doing a few videos for the songs at all? We might now we didn't want to do that at first. Just, we just kind of wanted to see, you know, and also to doing doing videos is, I don't know, personally, I don't know how necessary they are with everybody that's got iPhones and everything. You know, you know, everything you do is all posted and everything is already out there. So, you know, we might we might do that depending on how things go. But I like I like the I hate doing videos. Now I don't like it. It's so because you have to pretend, you know, you have to mime and you have to act like you're, you know, you have to act like you're playing and you're not. And it's just like, I mean, I don't I like watching other people's videos. And I think it's cool sometimes. But to actually do it, it's like, I feel stupid. It's like, you know, because you have to you're miming your your your air guitar or whatever you're doing or trying to it's just it's just not it's just not my bag. So it's, you know, but sometimes I guess it might be a necessary evil, but I just I'm not into it. But we might do it. You know, I love the fact that, you know, the some of the live shows people are posting those even though those are certainly aren't professionally done, but people can see the band, you know, so. Well, that's all people like watching and watching those videos and stuff. So yeah, right. Yeah. Going back to 84 and all those old videos that you guys made. Those were classics. Yeah. Well, you know, that was it was a different time then too. And there was a reason because there was MTV. Now everybody's got a phone. Everybody's got you know, I like doing the lyric videos that we did. I mean, that gets the song out there and people hear it and then, you know, and see that I don't mind that at all, you know, because I don't have to, you know, act like I'm doing that. So. So you have a few concerts coming up and a few in store appearances. I found that really cool. I've been still that's the time to. Hey, if there's a record store, man, if there's a record store, I'm there. Yeah. I love going to record stores. I would we need more of them. And that's why I'm so thrilled with the vinyl revival. You know, it's just like, yeah, bring back record stores. And I'm always digging through used record stores looking for classic old treasures and things like that, because that's all I listen to anymore is vinyl. So. Well, awesome. I love vinyl too. I had a huge selection, but I sold them on the. You idiot. But I've ruined mine when I was a kid. So when CDs came in, I just started buying, you know, started doing CDs. And then when vinyl started getting popular again, I was like, I didn't realize how much I missed it. So then I had to have started. I just started rebuilding my collection. Most of my vinyl that I had as a kid were just damaged, bong water spilled on them and, you know, and whatever damn party damage and stuff like that. So they weren't worth keeping. So I just started over, you know. So let's talk about the new album. Do you have any favorite songs off the album? Yeah, I like making monsters and I like children of the lie because it has one thing that I've always wanted to do. The ending of that song is that little nod to black Sabbath where the whole end of the song is like a completely song and they never get back to the original song where it just shifts gears completely. I love that. And I love that about that song. That and me, the nothing came out great. I do love another judgment day. Yeah, I'd say a prayer with seven bullets. I really dig that one. So yeah, those are kind of my favorites. So do you have like a song that you like playing live at all? Or have you guys, I don't think you guys have done any concerts since the new album came out. Have you ever? Oh yeah, we just did two shows, one in Chicago and one in Detroit. Yeah. So we went back and started out doing a lot of stuff off the first two records because, you know, well Mark's voice lends to that, but we also had been doing a lot of the Mike Howe era stuff when obviously when Mike was in the band, because that makes sense. But we wanted to go back and do a lot of the stuff that we haven't been doing. Yes, there are the staples that we have to do, but we wanted to, and I really wanted to throw in some, you know, some deep cuts, some surprise tracks off the first two records. So that's been really fun. Like playing psycho, for example, you know, that's, that's like, I don't remember if we ever did that or then burial at sea. And then there's, you know, a couple off the first record. So, you know, that's been a lot of fun. That's been a lot of fun. And watch the crowd react when we bust into a song that they didn't expect. That's really fun. That's a surprise. And they saw you doing that and surprising the fans that way. And that's pretty cool. Yeah. So do you have a favorite metal church album of all time or do you have one? No, I really don't. I mean, I mean, currently it's the new album, but that's cause it's new. You know, I really don't know. It changes. And, and again, when you're so close to it, when you make a record, you're so close to it, you really can't listen to it. At least I can't because all I hear is mistakes or things I would have changed or things I would rather do, you know, so that's really a tough one. That's really tough. So I can't imagine playing the same songs over and over again. I'd be freaking, Oh yeah. I mean, I always looked at Judas priest and I go, I wonder if they're tired of playing victim of changes as much as I love that song. You know, I bet they're like, Oh yeah. But the one thing that is true is, is, is, is nice. Is that when you do get in front of a crowd playing a song that you may not like the idea of playing, but when you get in front of a crowd and they're happy, that changes the feel of it. So it's not, it's not painful. So besides being in a metal church and being a vinyl collector, what else do you like to do in your spare time? See, I write songs and write other music and I have two other bands that I enjoy writing. I have Presto ballet, which is my version of seventies prog rock. And I just finished the new hall of flame record, which is the rock band that I was in after metal church. And we, we got together to just do, we were just going to document the songs that would never got released as our second record. So we just thought we'd let's, let's, let's just finish these. Let's not waste them. I mean, it's been 30 years, let's not waste these songs, you know? And so we got back together and started recording them and it came out absolutely just light years better than we had expected. So we decide, I decided like, no, let's do this. Let's, let's do this. And so that record is done and that should be coming out in the fall. And definitely we're going to be doing some shows and stuff like that. So I love doing that. That's awesome. Can't, can't wait to. I don't really do much else other than music. I'm kind of, I'm kind of one dimensional. There's nothing wrong with that. That's yeah, I just, I don't like, you know, I, I'm not, I don't collect anything else. I collect instruments and guitars and vintage synthesizers and you know, yeah, I do that and vinyl and you know, I'm always something, it always has something to do with music. So, So what made you want to start playing music in the first place? Like what, what motivated you? First memory, the Beatles on Ed Sullivan, that follow, that was a February of 64, that following my birthday was in June. That year I got a toy drum set and because my parents wanted to see if I was going to stick with it. I beat the crap out of that. And then the following Christmas, I got a real one. So it's never stopped. It just, it was like, that's what I want to do. And then in high school during the seventies, you know, going to the concerts and stuff I used to get to go see when I was growing up or just, I mean, I may be old now, but I wouldn't have changed a thing. Man, I got, I got to see, you know, Kansas open for Queen, you know, at a theater, you know, I got to see the who twice in one year I got to see kiss. I mean, rush open for kiss, you know, I got to see all this stuff, you know, and, you know, see Led Zeppelin and did you see Led Zeppelin at all? Yeah. Yeah. Yeah. And it was like, you know, so that was, and you know, see an Aerosmith before the drugs took over when they were just so devastatingly good, you know, that, I mean, just all these shows, I look back in the stores we used to, cause I lived in Aberdeen when we, it was two hours to Seattle. We used to go every weekend, you know, it seemed like, you know, and we would drive two hours and go see the, it just was, I mean, it was just, I wouldn't have changed a thing. So I mean, seeing that stuff, you know, was like, that's what I got to do that. I'm doing that, you know. Yeah. To grow up in the air and see all those amazing bands is triggering. Yeah. It's just, it's spoiled. Oh yeah. I mean, you know, it doesn't get any better than that. You know, I mean, that's that just built the industry and then, I mean, and the list goes on, you know, on and on and on for years, you going the bands that used to go see, you know, and it was just, it was crazy. So what are the future plans for Middle Church? What's wrong with that? Well, all we're doing right now is getting ready. We got a bunch of shows at the end of the month and we're going to do that. And I mean, so far, so good. We were just taking everything step at a time and we did our first two shows and they went amazingly well. Mark did a great job. He was received well. So that was very encouraging. So we've got a bunch of shows at the end of this month. We're going to do that. And, and if things continue, then we're going to continue. So, you know, and the response to the record has been great. So we're going to, you know, keep following up on that. It looks like we've got a few shows in Europe coming up and we're not actually touring at the moment. We're just doing long weekends and fly-ins here because it's just too expensive to tour right now. Like a lot of bands have canceled things because, you know, fuel. Yeah, I've seen it online there. A lot of the bands, the cost. Yeah. So we're just, we wanted to do, and we knew this, we knew this prior to all the BS that's going on, but we knew we wanted to do that because I just, you know, even though we are older and I love playing live, we don't really want to live in a tour bus for two or months. If we're playing some club and we're playing over by the salad bar, you know, we don't, I just like, no, no, I don't want to do that. So we're just, you know, picking and choosing when we get good offers to play cool places, you know, and then yeah, we'll do it. So, well, hopefully you come to Toronto. So I've yet to see you. Oh, we've tried to come to Toronto like three times and something always happens. Yeah. You know, I want to, I, yeah, I definitely want to because yeah, I love playing Toronto because my favorite band rush. And then I'm also a huge Max Webster, Kim Mitchell fan, you know, Triumph and all these great bands from Toronto. So I always love going to Toronto and just like, wow, all my favorite guys have been here, you know, because I'm still a goofy fan when it comes down to it and I still like that. So, you know, that's awesome. I have a lot of friends too. A lot of Canadians bands there you mentioned, I know them all. So, oh, absolutely. You know, and it's just kind of funny. Like the other day I was going through and I'd like looked at the records that I had out listening while I was working out or whatever. And I'm like, wow, I'm only listening to Canadian bands. I was listening to Brian Adams, who's fantastic. And I used to, Hall of Flame used to be managed by Bruce Allen, you know. And so, you know, and I was listening to BTO and, you know, then I love Kim Mitchell and Max Webster and Rush of course. And I've been really digging into my old Triumph records. And I'm like, wow, this is interesting. So going through phases and April Wine and all these, all these great, great bands, you know. And I do love Danko Jones from what I've heard of his. I really enjoy that too. So, you know, so there, I mean, there's just tons of stuff. You guys are killing it. Sure. Yeah. I just got, I'd seen the guys in Triumph there not too long ago. They had a documentary and I saw that. Yeah. Yeah. That was a really good one. Did you go, did you go to that show? It wasn't a show. It was like, For fan club or something? Yeah. And then we'll put it on a screen and go there and watch it. So it was really cool. Yeah, that was cool. That was very cool. Yeah. So the band's website is metalchurchofficial.com. I would just like tell everybody to go out there and buy the new album. I mean, it's amazing. You guys are just killing it. The songs are aggressive. I mean, I can't. Thank you very much. Like I'm saying, cause I love the band. Oh, thanks very much, man. I appreciate that. No problem. And I'm glad you came on the podcast today. You too. I guess that's about it. And I guess we'll talk later. Thanks very much. I appreciate it, man. We'll hopefully see you in Toronto soon. Okay. Good luck, man. Take care. Cheers, man. Take care. Thanks."}, "podcast_summary": "The podcast episode features an interview with Kurt Vanderhoof, guitarist and founder of the band Metal Church. The host expresses admiration for the band and asks about their new album and their new singer Mark Lopes. They discuss the process of finding a new singer after the passing of the previous one, and how the new album took shape. Kurt also talks about his other musical projects and his love for vinyl records. They touch upon the band's live shows and future plans.", "host_name": "Unknown", "date_published": "Unknown", "guests": ["Kurt Vanderhoof"], "artists_discussed": {"Metal Church": ["Congregation of Annihilation"]}, "commentary": "The interview provides insights into Metal Church's journey of finding a new singer and their latest album. Kurt Vanderhoof shares his thoughts on the band's evolution and their future plans. The discussion also highlights the importance of vinyl records and the joy of playing live shows.", "tone": "Friendly and enthusiastic", "highlights": "The interview includes discussions about Metal Church's new singer, their new album, their live shows, and their future plans.", "artist_details": {"Metal Church": "https://open.spotify.com/artist/0exvkfkATkqWOJgugTjJhP"}}