{
    "podcast_details": {
        "podcast_title": "Coffee and Country Music",
        "episode_title": "Mariachi and Country Music: Claudia Rascon",
        "episode_image": "https://media.rss.com/coffeeandcountrymusic/20201019_172049_2572f7ad33a10bd77a4c06a32d8b80f5.jpg",
        "episode_link": "https://rss.com/podcasts/coffeeandcountrymusic/485449",
        "episode_transcript": " I'm Abe Mack and you're listening to Coffee and Country Music. Come on with it! I always hope you're having a great start to your day. I hope you're having a nice coffee. I'm drinking Black Rifle Company Coffee located in Bernie, Texas. Veteran owned. Thank you to all the veterans out there listening. Today we get a chance to talk about music production, particularly this song called A Fan of Tequila. That is by the way playing in the background. If you haven't added it to your list, please do so. If you haven't checked out the music video, please do so. We appreciate your love and support. Well, recording the song and composing this idea of A Fan of Tequila was very challenging. I wanted to write something that was honest to my heritage. Mariachi music was very important to me growing up. It was actually the first style of music that I learned to play. The other part is country music. I wanted to do something that entailed something beautiful and respected. I can't think of anybody else than Johnny Cash. When you think about Ring of Fire and the Trumpets, man, it brings to you the Mariachi. And my good friend, Claudia Rascón, who is my guest today, she will be talking about how it was arranging and recording for A Fan of Tequila. A beautiful soul, a very talented artist herself, please look her up on Spotify and Instagram. My name is Claudia Rascón. Hello, my name is Claudia Rascón and this is Coffee and Country Music. This segment is brought to you by Tequila A La Fan. I was born in El Paso, Texas, and I actually studied in Boston. I did my major in music, did a bachelor's in music. And right now I'm a teacher at one of the high schools here in El Paso, Texas, El Dorado High School. I teach Mariachi. I'm instantly connected to A Fan of Tequila. Now watching the video, it looks like we were at my family's party. And I really like that it features very important elements of our border, of our hometown, really. Here in El Paso, you have those parties where Mariachi shows up and the whole family is dancing. But then you'll also have your tíos who love country music or who can really connect to country music. And then you'll switch over to Mariachi and they know that song as well. I think it depicts it perfectly, the style of partying that we do here at the border. My experience with Abe Mack was really fun. I tracked violin and then my friend, Steven, who's also a Mariachi player, he plays trumpet. We kind of just went into the studio and Abe was super excited to show us what was in his head. So I love doing that because I'm an artist myself and I love seeing when other artists are like, they're trying to explain to you, like, hey, this is what I hear in my head and this is what I want. This is kind of the vibe that I want. It's always super refreshing to work with creative artists because, you know, Abe wasn't like, oh, right, I want this G minor chord or I want this. No, he just said, I want this feel. And I'm thinking this and this is and you could see the like, you know, sparkle in his eyes when he would describe what he would imagine. And so I just thought it was really cool. Abe explained to us that he, you know, he comes from Mariachi music as well here in Socorro High School. And so it was just like it was it felt very satisfying to to be a part of of what he wants or what he wanted. And then to see it come alive. And then for him to, you know, when we finished the recording, he was super excited. He said, this is awesome, like we liked it. This is this is what I was expecting. This is what I wanted. And then it was also very refreshing because he totally gave us leeway. Like he just said, look, you guys know the Mariachi style, so just do what you guys would usually do, like improvise. So it was really fun, really cool, really relaxing. The significance and heritage behind Mariachi music and what it means to me. Well, I mean, ever since age 10 here in El Paso, Texas, I started playing Mariachi. So I started because I wanted to sing and we started a little girls group called Mariachi Florecitas. Then it went to Estrellitas and we all were all little girls. I think I was the youngest. I was maybe nine. And I really fell in love with Mariachi music. We experienced the Mariachi conference and we'd have we'd have Mariachi Cobre and all these amazing Mariachis come to Las Cruces and play for us and like give us classes and clinics. And I think I can't tell you what I enjoy the most, but I can definitely tell you that just to see people, you know, light up in a room or in a backyard when the Mariachi comes in is like everything to me. People are what make Mariachi so great. So I love connecting with people through this music. So I played with Mariachi de Patio here locally. We would do restaurants. We do, you know, gigs. We did the Chamisal Theater. We did the Plaza Theater. We went out to conferences. We did a lot of shows. Then after that, I went to college for music and there I kind of was like on a hiatus. Like I was just kind of taking everything in, learning different styles, learning from different people around the world, playing different instruments and different styles, different music. When I was in college in Boston, I found a Mariachi group. Not that I was looking for it. I just kind of found me. But I found a Mariachi group and I started gigging, you know, and then again, the connection with the people. I mean, people up there in Boston are super far from their families. Some of them are not even from Mexico. They're from like Colombia, from El Salvador, from Honduras, and they're connecting with this music. We would play all kinds of music. We would play, you know, rancheras, but then we'd also play like some pachata, like with Mariachi instruments, right? So last year, actually, I went on tour with an awesome group. They're called Floreto Loache. It's a female band. They play Mariachi instruments there from New York. They do medleys, like they do a cover of Nirvana songs with Mariachi instruments. They have their own original music, like new cumbias, new rancheras. When I was in Boston, I heard of them because, you know, it's hard to find a Mariachi up in Boston. And I remember writing to them. I said, hey, you know, if you ever need a violinist, I like what you're doing. I like your project. Because not only do they play rancheras, cumbias in Spanish, but they sing in English as well. One of their cool songs is Let Down. And it's like really like almost like ragtime. Like it's in Spanish and English. It's so cool. So they do these, they do this fusion. And I was totally instantly drawn to it. You know, they picked me to go on tour with them. And I knew how much, how exciting it was, but also how much work it was going to be and how much my life would change, you know. So we went on tour. We were the opening band for Mon Laferte, which is a Chilean artist who lives in Mexico City, but she has this amazing band, amazing crew. And we were the opening band for her. And it was just the most amazing experience I've ever lived, I've yet to live, you know. And it was life changing. And I'm so grateful for it. And it's interesting because I've always, like I said, Marieti has always been in my, you know, in my life. Whether once I came back from Boston, I mean, I was offered or I was applied for this job as a teacher, Marieti teacher, it's always been in my life. And now I've come to terms with the fact that I'm never going to, it's never going to leave me. I'm never going to leave it. And so, but, you know, not only Marieti, I mean, like I said, I love like folky American music, like Lake Street Dive. I don't know. I love John Mayer's style of writing, his guitar playing. I love country music, especially like just every, you know, folky, because I just think there's a huge connection to the people. Whatever type of folk music you play, you're connected directly to the people. Thanks Abe Mack for having me. And this is Coffee and Country Music. I want to thank Claudia for taking time to do a little segment for Coffee and Country Music. We hope you have a great day. Stay tuned for more artists, for more features. For the next few months, we're going to be pushing, giving you the behind the scenes stories with Abe Mack Music. On behalf of myself, my partner, Eddie B. Y'all have a great day and keep it country. This has been Coffee and Country Music."
    },
    "podcast_summary": "The podcast episode features the host, Abe Mack, and his guest Claudia Rascón, discussing the process of recording the song 'A Fan of Tequila,' which combines Mariachi and country music influences. Claudia shares her experience as a Mariachi musician and the significance of Mariachi music in her life. They also talk about their collaboration and the creative process behind the song. The episode ends with a thank-you message and a promise of future episodes featuring behind-the-scenes stories with Abe Mack Music.",
    "host_name": "Abe Mack",
    "date_published": null,
    "guests": [
        "Claudia Rascón"
    ],
    "artists_discussed": {
        "Abe Mack": [
            "A Fan of Tequila"
        ],
        "Johnny Cash": [
            "Ring of Fire"
        ],
        "Claudia Rascón": [],
        "Mariachi Florecitas": [],
        "Floreto Loache": []
    },
    "commentary": "The episode explores the blend of Mariachi and country music in 'A Fan of Tequila' and highlights the personal and cultural significance of Mariachi music in Claudia's life. The guests express their enjoyment and excitement in working together and the creativity involved in bringing their vision to life.",
    "tone": "Positive",
    "highlights": "The highlights of the episode include the discussion of the inspiration behind 'A Fan of Tequila' and the collaboration between Abe Mack and Claudia Rascón. Additionally, the mention of Floreto Loache and their unique fusion of Mariachi and other genres adds further interest to the episode.",
    "artist_details": {
        "Abe Mack": "https://open.spotify.com/artist/7sHO2trSS1fdIoI51NuUOt",
        "Johnny Cash": "https://open.spotify.com/artist/6kACVPfCOnqzgfEF5ryl0x",
        "Claudia Rascón": "https://open.spotify.com/artist/5iucHP7sNYHMsqeRa8Oaxf",
        "Mariachi Florecitas": "https://open.spotify.com/artist/71GMY7bXIFEG2MEcN4ckLd",
        "Floreto Loache": "https://open.spotify.com/artist/1JspXUvEv3D9ddMeLNqYWj"
    }
}