{"podcast_details": {"podcast_title": "The Podcast That Rocked", "episode_title": "SOAD VS Imagine Dragons | The Podcast That Rocked", "episode_image": "https://media.rss.com/rocked/20230512_030547_88088f2bdbd0d620811f5bb10669d454.jpg", "episode_link": "https://rss.com/podcasts/rocked/1081493", "episode_transcript": " This is the Podcast That Rocks, weekly podcast that talks about news in the world of rock, metal, alternative, and everything in between. My name is Luke, host of the YouTube channel Rocked, and we're going to jump into a lot of international news in a sense, because there's two stories that have happened this week that are actually pretty interesting regarding some Europe and Asia relationships with bands. The biggest one probably is a bit of a conflict between System of a Down, Serj Tankin, and the band Imagine Dragons. Some of you will make jokes in the comments right away about Imagine Dragons and how everyone's against them, but I'll just leave that for the comments section. Turns out that Imagine Dragons just announced a big show in Azerbaijan, which is a very high conflict area that has dealt with dictatorship and a lot of humanitarian issues for quite a while. The issue is that many other bands have played there over the years, including Recently, and now that Imagine Dragons has announced a performance there, Activist for All Things in the Armenia area and other stuff, Serj Tankin did not like that. Serj Tankin sent a message to the singer of Imagine Dragons and the group in general saying they need to reschedule or cancel and just be aware of the situation. Well, the worst response apparently to Serj Tankin is silence because there was no response and the show is still going on as planned. The follow up came this week when Serj went online on all socials and made a big public statement about this. From Serj Tankin, now it has to be said. A few months ago it came to my attention that Imagine Dragons had planned a show on September 2nd in Baku, Azerbaijan. I was sure they were unaware that Azerbaijan's petro-allegarhic-dictatorial regime was starving 120,000 people in Nagorno-Karabakh, which is now being called a genocide by the former prosecutor of the International Criminal Court, Luis Moreno Ocampo. So through representatives I sent them a kind letter, this being Imagine Dragons, urging them to reconsider playing their show in Azerbaijan as it would help whitewash the dictatorial regimes in my image there. I included various articles including one of my Amnesty's International who I was told they have worked with in the past. There was no response. No answer. No response. As the humanitarian crisis worsens in Nagorno-Karabakh, with starvation already being recorded, I am forced to publicize this letter and their disregard for their humanitarian catastrophe. Maybe they felt like they had a legal liability to play the show, maybe they just don't care. My whole life I've been an advocate for genocide recognition and have always said there has to be a price to pay for genocidal regimes or deniers. Another genocide is looming by Azerbaijan and while this happens, they get to enjoy an American ban from Las Vegas. F that. That's not right. That was the statement from Serge Tankin and there are many many many takes and responses about the situation, what Serge said, how this is all playing out. Now just to make it clear this is my viewpoint on all this, no I am not an expert on Armenian, Azerbaijan, or anything else going on in the area with that. There are many other people that are more knowledgeable about the current conflicts going on there. First of all, it is possible that Imagine Dragons did not know or were not aware of the direct response and the actual current issues going on there. That is very possible. Number two, it's possible the show was scheduled without Imagine Dragons' knowledge. It happens way more often than you think and with big names and stars who do not know they're playing a show until after the show is announced. Sometimes when they see it posted on social media they understand, oh we're playing that are we? Sometimes they don't know. That being said, no response can be a terrible response. If this was handed directly to the band and band management and nothing was done about it, that's pretty dark considering this is Serge Tankin who has directly handled a lot of the amnesty issues and stuff like this over the years and if Imagine Dragons has worked with this amnesty group as well in the past then there should have been a communication forum somehow. There should have been some lot of communication. That's not to say that there haven't been other bands recently that have played there as well. There have been many bands that have in fact and big name artists. So you can't say this is a one and done thing. It's just Imagine Dragons doing this. It's a mess of a situation. I applaud activism in a proper and appropriate way but this is a murky thing because now it does look like it's gonna be System of a Down versus Imagine Dragons in the Battle of Asverajan. Boy oh boy is that a mouthful and a madlib statement right there. It's gonna be messy but at the same time I hope this will at least enlighten people on the crisis going on over there in the situation. I don't know really how to feel about a situation like this with a band playing there because there are bands that will go to war torn countries and nations all the time for different reasons. We're gonna have to wait and see what's gonna be said by the Imagine Dragons camp. I'm assuming now something will be said in some way. I just know boy flames can be fanned much more when no one says anything especially if someone's ignored and that's what's going on now. From Asverajan to Russia and Georgia we go to a different situation across the seas and this one is a little bit more awkward in situation because The Killers, another Las Vegas band, I don't know what's going on with Vegas bands this week, The Killers had a big performance in Georgia not the state, the country. There's a country named Georgia. They gained independence from Russia back in 1991. The issue is that they were playing a show and were talking about Russia and conflicts and were also having Brandon Flowers about to bring out someone from Russia. He handled the situation very poorly to the point where he had to issue a big apology and boy oh boy were The Killers booed on stage during everything. Brandon Flowers also said during the show, he's like, I'm your brother aren't I? Aren't I one of you? And he went into more boos and Brandon Flowers actually turned his back to the crowd which made it more awkward. I do feel this was all done without any intention of malice or making a big negative statement or trying to set a divide but there's also such a thing as knowing your audience and from a perspective of Georgia, the nation, seeing someone brought out from Russia, hearing Russia in America you think certain things. You think Putin. You think the Ukraine war. You think other things. In Georgia, you have a way different outlook and it's not always pretty. Here's some audio of what in the world happened. That's where you want to separate it all? So I'm not your brother? Am I not your brother? Being from America, am I your brother? No. I'm not your brother? One of the things that we have come to appreciate about being in this band is it brings people together. And tonight I want us to celebrate that we're here together and I don't want us to turn over. And I see you as my brothers and my sisters. This is Georgia! Boo! Boo! Boo! Boo! Boo! Boo! Boo! Boo! Boo! Boo! Boo! Boo! Boo! Boo! Boo! Boo! Boo! Boo! Boo! Boo! Boo! Boo! Boo! Boo! Boo! Boo! Boo! Boo! Boo! Boo! Boo! Boo! Boo! Boo! Boo! Boo! Boo! Boo! Boo! Boo! Boo! Boo! So that was just some of the audio. Rock Feed Playlist, I'll link to that on the podcast page on rock.net. Have your own thoughts about this, but again, they did make an apology and I just feel this is, one, something very awkward that really should not have been there. I do not think he was expecting that situation and I don't think he was trying to aim for anything like this. I think he was just trying to make a good statement, a peaceful and non-offensive thing, and boy oh boy did it spiral out of control by just saying the wrong thing and handling the mannerisms and being caught in the moment and making it worse himself. Going back in time to some more lighthearted news, there was some information dropped about one of the biggest songs of the early 2000s with Evanescence and Bring Me to Life. The original rap part that Amy Lee said she never wanted to do the song in the first place from the 12 Zone singer was not the first pick. Turns out there were two picks before that. The rap part you hear in the New Metal Anthem was originally promoted to Mike Shinoda of Linkin Park who turned it down politely, whether that was scheduling issues or anything else, it was Mike Shinoda. Then it was offered to Josie Scott of Saliva who also turned it down just because of schedules and things getting mixed up. Josie said, our schedules were mixed up or something and I didn't get to do it so the kid from 12 Stones did it. I actually don't have a problem with the 12 Stone singer. I remember that 12 Stones album back in the day, it was fine. The issue is I don't think it would be as respected or loved if it was Josie Scott doing that part. I don't know. I just I can't hear it as well. I'm sure AI could probably make Josie Scott do that part and splice that into the Evanescence song but boy oh boy I just feel like that would have been a turn for the worse. Too bad Mike Shinoda couldn't do it. I'm a huge Mike Shinoda fan. I'm a huge Linkin Park fan. But things happen like that. Songs find the way it is. I just think it's interesting to hear the backstories about all this and how things could have played out. In other new metal news, Korn released Follow the Leader 25 years ago this week. 25 years of songs like Got the Life and Freak on a Leash and the album has not aged perfectly. I'll say that. This is one of the most memorable Korn albums, if not the most memorable in my opinion, just because of how big of a deal Korn was in the late 90s as a big part of this album for the reason why. When you had songs like Got the Life and Freak on a Leash which are still massive songs, there's other material on there that is definitely not worth hearing and probably should have been left behind like all in the family. I think Korn and Jonathan Davis have even admitted that. But at the same time this is a big, big album for new metal back in the day that actually put it in a better spotlight for something different than traditional metal. This was something new and I do feel it's worth revisiting some of the songs on Follow the Leader 25 years ago this week. The amount of new music news that dropped this week for new releases, new songs is gargantuan and I cannot cover it all without making this podcast way too long and people would click out. I'm just gonna go over some of the big ones, the biggest being Guns N' Roses releasing a new song, perhaps, that dropped this week. First to TouchTunes, if you're not sure what TouchTunes is, that's the bar and pool hall and restaurant jukebox that's linked up to their own private servers. Well, it leaked to TouchTunes only and it was probably by mistake. It was taken down later. So if you were at a pool hall at a certain hour earlier this week, you could have gotten lucky and heard, perhaps, before anyone else. Doesn't matter now that it's available online everywhere as of today. Also Talk Sick, T-A-L-K-S-I-C-K, the new single from Corey Taylor off CMF2 was released with a lyric video, CMF2 coming out next month, along with Baroness' Stone new album, they released their third single Shine, that just came out today. The new's Babymetal featuring Tom Morello, boy is that an awesome collaboration, released the new song, Metalli, that's kinda cool to hear. All of this will be played on New Music Night and more, including the new Within Temptation song Bleed Out, the title track for their upcoming album. You'll also hear new music that came this week from Ministry's latest album that got announced. 16th album from Ministry announced, new single being played on New Music Night, a new special single for Death Cat for Cutie, new album from the Menzingers, from the Menzingers, new Disarach, new Bad Wolves, new Anne is Okay, new era single, there's so much more, I can't keep up. I'm looking at the New Music Night playlist right now, 22 songs, most of which have some name value too, it's not just like unheard or new artists. Please join, it's Sunday 5pm Eastern on the YouTube channel, we might go longer than two hours, your suggestions are greatly welcomed with this as well, just to make sure we cover everything. Check that out, there's so much more, you can check out articles and some of the more album drop information on rock.net. Final thing to address, coming up on the YouTube channel next week will be a follow up to a video I did weeks ago, 10 artists who hate their own song was a video I did a few years back, this one will be 10 more artists who hate their own songs. I'll give a little bit of a spoiler on one of them, I had no idea until I started doing real research for this. Pinball Wizard from The Who. Not only did Pete Townshend hate the song, he hated it as soon as he wrote it, as he was finished, he was embarrassed by it. I just think that's interesting. I'll give more quotes, I have much more information on all these songs, it's wild to go back and hear and see just how much some artists despise their own work for various reasons, but that'll be on the channel next week. Big thanks to my patrons and YouTube members, special thanks to Chris Dome and Brandon Bruce and Dom Noble, also big thank you to everyone that checks out New Music Night on Sunday 5pm Eastern, again, please join us, it's a lot of fun, song suggestions are welcome, thank you guys again, have a great week, and also, if you're from Las Vegas, please keep in mind International Affairs, it seems like you guys there have a little bit of an issue with that."}, "podcast_summary": "The Podcast That Rocks discusses recent controversies involving System of a Down, Imagine Dragons, and The Killers. They talk about Imagine Dragons' upcoming show in Azerbaijan and the criticism they received from Serj Tankin. They also address The Killers' performance in Georgia and the backlash they faced for involving Russia. The podcast also touches on the original rap part in Evanescence's 'Bring Me to Life' and the 25th anniversary of Korn's 'Follow the Leader' album. Lastly, they mention various new music releases, including Guns N' Roses, Corey Taylor, and Babymetal featuring Tom Morello.", "host_name": "Luke", "date_published": "Not mentioned", "guests": [], "artists_discussed": {"System of a Down": ["-"], "Imagine Dragons": ["-"], "The Killers": ["-"], "Evanescence": ["Bring Me to Life"], "Korn": ["Follow the Leader"], "Guns N' Roses": ["-"], "Corey Taylor": ["CMF2"], "Babymetal": ["Metalli"], "Tom Morello": ["-"]}, "commentary": "The Podcast That Rocks delves into recent controversies in the rock music scene. They provide a balanced perspective on the conflicts involving System of a Down, Imagine Dragons, and The Killers, highlighting the complexities of these situations. They also offer insights into the origins of popular songs, such as Evanescence's 'Bring Me to Life,' and discuss the continued relevance of seminal albums like Korn's 'Follow the Leader'. The podcast concludes with an overview of notable new music releases.", "tone": "Informative and objective", "highlights": "1. Controversy surrounding Imagine Dragons' upcoming show in Azerbaijan\n2. The Killers' performance in Georgia and the backlash they faced\n3. Insights into the creation of Evanescence's 'Bring Me to Life'\n4. 25th anniversary of Korn's 'Follow the Leader' album\n5. New music releases from Guns N' Roses, Corey Taylor, Babymetal featuring Tom Morello, and more", "artist_details": {"System of a Down": "https://open.spotify.com/artist/5eAWCfyUhZtHHtBdNk56l1", "Imagine Dragons": "https://open.spotify.com/artist/53XhwfbYqKCa1cC15pYq2q", "The Killers": "https://open.spotify.com/artist/0C0XlULifJtAgn6ZNCW2eu", "Evanescence": "https://open.spotify.com/artist/5nGIFgo0shDenQYSE0Sn7c", "Korn": "https://open.spotify.com/artist/3RNrq3jvMZxD9ZyoOZbQOD", "Guns N' Roses": "https://open.spotify.com/artist/3qm84nBOXUEQ2vnTfUTTFC", "Corey Taylor": "https://open.spotify.com/artist/0nhDd1RWjZ6SDV1Vg1Ku2Q", "Babymetal": "https://open.spotify.com/artist/630wzNP2OL7fl4Xl0GnMWq", "Tom Morello": "https://open.spotify.com/artist/74NBPbyyftqJ4SpDZ4c1Ed"}}